In [1]:
%load_ext sql
%sql postgresql://postgres:Password02117@localhost/learning

In [2]:
%%sql

select * from actors limit 5;

 * postgresql://postgres:***@localhost/learning
5 rows affected.

[('Malin', 'Akerman', 'F', datetime.datetime(1978, 5, 12, 0, 0)),
 ('Tim', 'Allen', 'M', datetime.datetime(1953, 6, 13, 0, 0)),
 ('Julie', 'Andrews', 'F', datetime.datetime(1935, 10, 1, 0, 0)),
 ('Ivana', 'Baquero', 'F', datetime.datetime(1994, 6, 11, 0, 0)),
 ('Lorraine', 'Bracco', 'F', datetime.datetime(1954, 10, 2, 0, 0))]

In [3]:
%%sql
select * from movies limit 5;

 * postgresql://postgres:***@localhost/learning
5 rows affected.

[(1, 'A Clockwork Orange', 112, 'English', datetime.date(1972, 2, 2), '18', 13),
 (2, 'Apocalypse Now', 168, 'English', datetime.date(1979, 8, 15), '15', 9),
 (3, 'Battle Royale ', 111, 'Japanese', datetime.date(2001, 1, 4), '18', 10),
 (4, 'Blade Runner ', 121, 'English', datetime.date(1982, 6, 25), '15', 27),
 (5, 'Chungking Express', 113, 'Chinese', datetime.date(1996, 8, 3), '15', 35)]